src/test/load/artillery/system/update-config/malicious-peers/group-10.yml
config:
  target: http://192.168.0.182:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.182:4036/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4051/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4045/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4039/nomad/config/groups/testing/malicious-peer?enabled=false"