src/test/load/artillery/system/update-config/malicious-peers/group-5.yml
config:
  target: http://192.168.0.150:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.150:4015/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.150:4022/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.150:4008/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.150:4007/nomad/config/groups/testing/malicious-peer?enabled=false"