src/test/load/artillery/system/update-config/malicious-peers/group-9.yml
config:
  target: http://192.168.0.182:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.182:4038/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4041/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4044/nomad/config/groups/testing/malicious-peer?enabled=false"
      - post:
          url: "http://192.168.0.182:4037/nomad/config/groups/testing/malicious-peer?enabled=false"